const queryAll = {
  content: [
    {
      id: 1542012907763,
      date: '2018-11-12 16:55:07',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '1'
    },
    {
      id: 1542012329097,
      date: '2018-11-12 16:45:29',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.76/',
      operationType: '1'
    },
    {
      id: 1542012328950,
      date: '2018-11-12 16:45:28',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.76/',
      operationType: '0'
    },
    {
      id: 1542010753238,
      date: '2018-11-12 16:19:13',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '0'
    },
    {
      id: 1542010738079,
      date: '2018-11-12 16:18:58',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '1'
    },
    {
      id: 1542010633601,
      date: '2018-11-12 16:17:13',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '1'
    },
    {
      id: 1542010633497,
      date: '2018-11-12 16:17:13',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '0'
    },
    {
      id: 1542010025315,
      date: '2018-11-12 16:07:05',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '0'
    },
    {
      id: 1542009742216,
      date: '2018-11-12 16:02:22',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '0'
    },
    {
      id: 1542009740228,
      date: '2018-11-12 16:02:20',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '1'
    },
    {
      id: 1542009186741,
      date: '2018-11-12 15:53:06',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.76/',
      operationType: '0'
    },
    {
      id: 1542009184394,
      date: '2018-11-12 15:53:04',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.76/',
      operationType: '1'
    },
    {
      id: 1542003975960,
      date: '2018-11-12 14:26:15',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '0'
    },
    {
      id: 1542003105404,
      date: '2018-11-12 14:11:45',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '1'
    },
    {
      id: 1542002402478,
      date: '2018-11-12 14:00:02',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '0'
    },
    {
      id: 1542002399888,
      date: '2018-11-12 13:59:59',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '1'
    },
    {
      id: 1542001974012,
      date: '2018-11-12 13:52:54',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.76/',
      operationType: '0'
    },
    {
      id: 1542001971996,
      date: '2018-11-12 13:52:51',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.76/',
      operationType: '1'
    },
    {
      id: 1542000415267,
      date: '2018-11-12 13:26:55',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '0'
    },
    {
      id: 1542000410605,
      date: '2018-11-12 13:26:50',
      user: '超级档案管理员',
      result: '1',
      ip: '202.96.50.107/',
      operationType: '1'
    }
  ],
  pageSize: 20,
  pageNo: 0,
  pageCount: 0,
  totalCount: 2567,
  message: null
}
const queryAllLog = {
  content: [
    {
      contentList: [
        '[{"父类目名称":"基本建设类","分类号":"6","案卷题名":"123","保管期限":"永久","deptPassUser":"116","fondsCode":"1377226592843","是否关联":"否","终止日期":"2018-11-12","type":"v","isModifyByRejected":"false","创建人":"超级档案管理员","id":1541992822464,"卷内数量":"1","全宗":"1377226592843","是否退回":"否","案卷号":"1","创建日期":"2018-11-12 11:20:22","归档日期":"2018-11-12","最后修改人":"超级档案管理员","状态":"待整理","页数":"0","档案类型ID":"1361066263788","接收日期":"2018-11-12","borrowed":"2","类目名称":"基本建设类","年度":"1999","室编档号":"6-1999-永久-0001","检查状态":"未检查","归档部门":"1537957874444","subm',
        'itDeptUser":"116","归档人":"超级档案管理员","接收人":"超级档案管理员","最后修改日期":"2018-11-12 11:20:22","archiveTypeId":1361066263788,"起始日期":"2018-11-12","是否删除":"否"}]'
      ],
      date: '2018-11-12 11:20:51',
      description: '接收',
      id: 1541992851634,
      ip: '192.168.1.118',
      officeArchivalCode: '',
      operate: '档案接收',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        '[{"父类目名称":"基本建设类","分类号":"6","案卷题名":"123","保管期限":"永久","deptPassUser":"116","fondsCode":"1377226592843","是否关联":"否","终止日期":"2018-11-12","type":"v","isModifyByRejected":"false","创建人":"超级档案管理员","id":1541992822464,"卷内数量":"1","全宗":"1377226592843","是否退回":"否","案卷号":"1","创建日期":"2018-11-12 11:20:22","归档日期":"2018-11-12","最后修改人":"超级档案管理员","状态":"待接收","页数":"0","档案类型ID":"1361066263788","类目名称":"基本建设类","年度":"1999","borrowed":"2","室编档号":"6-1999-永久-0001","检查状态":"未检查","归档部门":"1537957874444","submitDeptUser":"116","归',
        '档人":"超级档案管理员","最后修改日期":"2018-11-12 11:20:22","archiveTypeId":1361066263788,"起始日期":"2018-11-12","是否删除":"否"}]'
      ],
      date: '2018-11-12 11:20:47',
      description: '归档',
      id: 1541992847318,
      ip: '192.168.1.118',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        '[{"保管期限":"永久","分类号":"6","序号":"1","ownerId":"1541992822464","文件日期":"2018-11-12","正题名":"1111","fondsCode":"1377226592843","是否关联":"否","案卷ID":"{\\"archiveTypeId\\":1361066263788,\\"associated\\":false,\\"borrowed\\":\\"2\\",\\"catalogueName\\":\\"基本建设类\\",\\"checkStatus\\":\\"0\\",\\"createDate\\":\\"2018-11-12 11:20:22\\",\\"createUser\\":\\"116\\",\\"deleted\\":false,\\"filingDept\\":\\"1537957874444\\",\\"filingUser\\":\\"116\\",\\"folderNo\\":1,\\"fondsCode\\":\\"1377226592843\\",\\"itemCount\\":0,\\"lastDate\\":\\"2018-11-12 11:20:22\\",\\"',
        'lastUser\\":\\"116\\",\\"officeArchivalCode\\":\\"6-1999-永久-0001\\",\\"parentCatalogueName\\":\\"基本建设类\\",\\"reject\\":false,\\"retentionPeriod\\":\\"3\\",\\"seriesCode\\":\\"6\\",\\"status\\":\\"30\\",\\"titleProper\\":\\"123\\",\\"type\\":\\"v\\",\\"yearCode\\":1999}","type":"f","创建人":"超级档案管理员","id":1541992830614,"全宗":"1377226592843","是否退回":"否","创建日期":"2018-11-12 11:20:30","最后修改人":"超级档案管理员","状态":"待审核","电子全文数":"0","页号":"1","档案类型ID":"1361066263788","borrowed":"2","室编档号":"6-1999-永久-0001-0001","归档部门":"1537957874444","检查状态":"未检查","是',
        '否并文":"否","归档人":"超级档案管理员","最后修改日期":"2018-11-12 11:20:30","archiveTypeId":1361066263788,"是否删除":"否"}]'
      ],
      date: '2018-11-12 11:20:30',
      description: '新增',
      id: 1541992830627,
      ip: '192.168.1.118',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        [
          {
            父类目名称: '基本建设类',
            案卷题名: '123',
            分类号: '6',
            保管期限: '永久',
            创建日期: '2018-11-12 11:20:22',
            最后修改人: '超级档案管理员',
            状态: '待审核',
            fondsCode: '1377226592843',
            是否关联: '否',
            type: 'v',
            档案类型ID: '1361066263788',
            创建人: '超级档案管理员',
            id: 1541992822464,
            卷内数量: '0',
            borrowed: '2',
            类目名称: '基本建设类',
            年度: '1999',
            室编档号: '6-1999-永久-0001',
            检查状态: '未检查',
            归档部门: '1537957874444',
            是否退回: '否',
            全宗: '1377226592843',
            归档人: '超级档案管理员',
            案卷号: '1',
            最后修改日期: '2018-11-12 11:20:22',
            archiveTypeId: 1361066263788,
            是否删除: '否'
          }
        ]
      ],
      date: '2018-11-12 11:20:22',
      description: '新增',
      id: 1541992822467,
      ip: '192.168.1.118',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        '[{"分类号":"1.01","保管期限":"永久","正题名":"123","deptPassUser":"116","fondsCode":"1377226592843","是否关联":"是","type":"f","isModifyByRejected":"false","创建人":"超级档案管理员","id":1540989656784,"submitLeadUser":"116","全宗":"1377226592843","是否退回":"否","创建日期":"2018-10-31 20:40:56","inceptDate":"2018-11-12","归档日期":"2018-11-09","最后修改人":"超级档案管理员","电子全文数":"2","状态":"已整理","页数":"0","件号":"21","档案类型ID":"1352286661109","leadPassUser":"116","borrowed":"1","年度":"1999","室编档号":"CES-永久-1999-0021","检查状态":"未检查","归档部门":"1537957874444","',
        'submitDeptUser":"116","是否并文":"是","归档人":"超级档案管理员","接收人":"超级档案管理员","最后修改日期":"2018-10-31 20:40:56","archiveTypeId":1352286661109,"是否删除":"否"}]'
      ],
      date: '2018-11-12 10:36:59',
      description: '完成',
      id: 1541990218999,
      ip: '192.168.1.118',
      officeArchivalCode: '',
      operate: '档案整理',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        '[{"保管期限":"永久","分类号":"1.01","正题名":"123","fondsCode":"1377226592843","是否关联":"否","type":"f","isModifyByRejected":"false","创建人":"超级档案管理员","id":1539940357915,"submitLeadUser":"116","全宗":"1377226592843","是否退回":"否","创建日期":"2018-10-19 17:12:37","最后修改人":"超级档案管理员","状态":"已整理","电子全文数":"0","件号":"1","档案类型ID":"1352286661109","leadPassUser":"116","年度":"1999","borrowed":"1","室编档号":"CES-永久-1999-0001","归档部门":"1537957874444","检查状态":"未检查","是否并文":"否","归档人":"超级档案管理员","最后修改日期":"2018-10-19 17:12:37","archiveTypeId":1352',
        '286661109,"是否删除":"否"}]'
      ],
      date: '2018-11-12 10:36:57',
      description: '完成',
      id: 1541990217840,
      ip: '192.168.1.118',
      officeArchivalCode: '',
      operate: '档案整理',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        '[{"分类号":"1.01","保管期限":"永久","正题名":"123","deptPassUser":"116","fondsCode":"1377226592843","是否关联":"是","type":"f","isModifyByRejected":"false","创建人":"超级档案管理员","id":1540989656784,"全宗":"1377226592843","是否退回":"否","创建日期":"2018-10-31 20:40:56","inceptDate":"2018-11-12","归档日期":"2018-11-09","最后修改人":"超级档案管理员","电子全文数":"2","状态":"待整理","页数":"0","件号":"21","档案类型ID":"1352286661109","年度":"1999","borrowed":"2","室编档号":"CES-永久-1999-0021","检查状态":"未检查","归档部门":"1537957874444","submitDeptUser":"116","是否并文":"是","归档人":"超级档案',
        '管理员","接收人":"超级档案管理员","最后修改日期":"2018-10-31 20:40:56","archiveTypeId":1352286661109,"是否删除":"否"},{"分类号":"1.01","保管期限":"永久","正题名":"123","deptPassUser":"116","fondsCode":"1377226592843","是否关联":"否","type":"f","isModifyByRejected":"false","创建人":"超级档案管理员","id":1540989828373,"全宗":"1377226592843","是否退回":"否","创建日期":"2018-10-31 20:43:48","inceptDate":"2018-11-12","归档日期":"2018-11-09","最后修改人":"超级档案管理员","电子全文数":"0","状态":"待整理","件号":"23","档案类型ID":"1352286661109","年度":"1999","borrowed":"2","室编档号":"1.01-永久-1999-00',
        '23","检查状态":"未检查","归档部门":"1537957874444","submitDeptUser":"116","是否并文":"否","归档人":"超级档案管理员","接收人":"超级档案管理员","最后修改日期":"2018-10-31 20:43:48","archiveTypeId":1352286661109,"是否删除":"否"},{"分类号":"1.01","保管期限":"永久","正题名":"123","deptPassUser":"116","fondsCode":"1377226592843","是否关联":"是","type":"f","isModifyByRejected":"false","创建人":"超级档案管理员","id":1540989883964,"全宗":"1377226592843","是否退回":"否","创建日期":"2018-10-31 20:44:43","inceptDate":"2018-11-12","归档日期":"2018-11-12","最后修改人":"超级档案管理员","电子全文数":"0","状态":"待整理",',
        '"件号":"24","档案类型ID":"1352286661109","年度":"1999","borrowed":"2","室编档号":"1.01-永久-1999-0024","检查状态":"未检查","归档部门":"1537957874444","submitDeptUser":"116","是否并文":"否","归档人":"超级档案管理员","接收人":"超级档案管理员","最后修改日期":"2018-10-31 20:44:43","archiveTypeId":1352286661109,"是否删除":"否"}]'
      ],
      date: '2018-11-12 09:57:26',
      description: '接收',
      id: 1541987846207,
      ip: '192.168.1.118',
      officeArchivalCode: '',
      operate: '档案接收',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        '[{"保管期限":"永久","分类号":"1.01","正题名":"123","deptPassUser":"116","fondsCode":"1377226592843","是否关联":"是","type":"f","isModifyByRejected":"false","创建人":"超级档案管理员","id":1540989883964,"全宗":"1377226592843","是否退回":"否","创建日期":"2018-10-31 20:44:43","归档日期":"2018-11-12","最后修改人":"超级档案管理员","状态":"待接收","电子全文数":"0","件号":"24","档案类型ID":"1352286661109","年度":"1999","borrowed":"2","室编档号":"1.01-永久-1999-0024","归档部门":"1537957874444","检查状态":"未检查","submitDeptUser":"116","是否并文":"否","归档人":"超级档案管理员","最后修改日期":"2018-10-31 20:44:43',
        '","archiveTypeId":1352286661109,"是否删除":"否"}]'
      ],
      date: '2018-11-12 09:57:10',
      description: '归档',
      id: 1541987830437,
      ip: '192.168.1.118',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        '[{"保管期限":"永久","分类号":"1.01","正题名":"123","deptPassUser":"116","fondsCode":"1377226592843","是否关联":"否","type":"f","isModifyByRejected":"false","创建人":"超级档案管理员","id":1540989828373,"全宗":"1377226592843","是否退回":"否","创建日期":"2018-10-31 20:43:48","归档日期":"2018-11-09","最后修改人":"超级档案管理员","状态":"待接收","电子全文数":"0","件号":"23","档案类型ID":"1352286661109","年度":"1999","borrowed":"2","室编档号":"1.01-永久-1999-0023","归档部门":"1537957874444","检查状态":"未检查","submitDeptUser":"116","是否并文":"否","归档人":"超级档案管理员","最后修改日期":"2018-10-31 20:43:48',
        '","archiveTypeId":1352286661109,"是否删除":"否"}]'
      ],
      date: '2018-11-09 11:14:38',
      description: '归档',
      id: 1541733278246,
      ip: '172.29.150.1',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        '[{"分类号":"1.01","保管期限":"永久","正题名":"123","deptPassUser":"116","fondsCode":"1377226592843","是否关联":"是","type":"f","isModifyByRejected":"false","创建人":"超级档案管理员","id":1540989656784,"全宗":"1377226592843","是否退回":"否","创建日期":"2018-10-31 20:40:56","归档日期":"2018-11-09","最后修改人":"超级档案管理员","电子全文数":"2","状态":"待接收","页数":"0","件号":"21","档案类型ID":"1352286661109","年度":"1999","borrowed":"2","室编档号":"CES-永久-1999-0021","检查状态":"未检查","归档部门":"1537957874444","submitDeptUser":"116","是否并文":"是","归档人":"超级档案管理员","最后修改日期":"2018-10-31 ',
        '20:40:56","archiveTypeId":1352286661109,"是否删除":"否"}]'
      ],
      date: '2018-11-09 10:19:01',
      description: '归档',
      id: 1541729941946,
      ip: '172.29.150.1',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        '[{"保管期限":"永久","分类号":"1.01","正题名":"123","deptPassUser":"116","fondsCode":"1377226592843","是否关联":"是","type":"f","isModifyByRejected":"false","创建人":"超级档案管理员","id":1540989656784,"全宗":"1377226592843","是否退回":"否","创建日期":"2018-10-31 20:40:56","最后修改人":"超级档案管理员","状态":"部门审核通过","电子全文数":"2","页数":"0","件号":"21","档案类型ID":"1352286661109","年度":"1999","borrowed":"2","室编档号":"CES-永久-1999-0021","归档部门":"1537957874444","检查状态":"未检查","submitDeptUser":"116","是否并文":"是","归档人":"超级档案管理员","最后修改日期":"2018-10-31 20:40:56","archiv',
        'eTypeId":1352286661109,"是否删除":"否"}]'
      ],
      date: '2018-11-06 09:44:34',
      description: '关联',
      id: 1541468674976,
      ip: '192.168.1.110',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        [
          {
            分类号: '1.02',
            保管期限: '永久',
            创建日期: '2018-10-31 20:51:31',
            最后修改人: '超级档案管理员',
            正题名: 'bingwen1',
            电子全文数: '0',
            状态: '待审核',
            页数: '0',
            fondsCode: '1377226592843',
            是否关联: '否',
            件号: '1',
            type: 'f',
            档案类型ID: '1352286661109',
            创建人: '超级档案管理员',
            id: 1540990291056,
            borrowed: '2',
            年度: '1999',
            室编档号: '1.02-永久-1999-0001',
            检查状态: '未检查',
            归档部门: '1537957874444',
            是否退回: '否',
            全宗: '1377226592843',
            是否并文: '是',
            归档人: '超级档案管理员',
            最后修改日期: '2018-10-31 20:51:31',
            archiveTypeId: 1352286661109,
            是否删除: '否'
          }
        ]
      ],
      date: '2018-10-31 20:51:31',
      description: '并文',
      id: 1540990291122,
      ip: '192.168.1.111',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        [
          {
            分类号: '1.02',
            保管期限: '永久',
            创建日期: '2018-10-31 20:51:21',
            最后修改人: '超级档案管理员',
            正题名: 'bingwen2',
            电子全文数: '0',
            状态: '待审核',
            fondsCode: '1377226592843',
            是否关联: '否',
            件号: '2',
            type: 'f',
            档案类型ID: '1352286661109',
            创建人: '超级档案管理员',
            id: 1540990281781,
            borrowed: '2',
            年度: '1999',
            室编档号: '1.02-永久-1999-0002',
            检查状态: '未检查',
            归档部门: '1537957874444',
            是否退回: '否',
            全宗: '1377226592843',
            是否并文: '否',
            归档人: '超级档案管理员',
            最后修改日期: '2018-10-31 20:51:21',
            archiveTypeId: 1352286661109,
            是否删除: '否'
          }
        ]
      ],
      date: '2018-10-31 20:51:21',
      description: '新增',
      id: 1540990281789,
      ip: '192.168.1.111',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        [
          {
            分类号: '1.02',
            保管期限: '永久',
            创建日期: '2018-10-31 20:51:04',
            最后修改人: '超级档案管理员',
            正题名: 'bingwen1',
            电子全文数: '0',
            状态: '待审核',
            fondsCode: '1377226592843',
            是否关联: '否',
            件号: '1',
            type: 'f',
            档案类型ID: '1352286661109',
            创建人: '超级档案管理员',
            id: 1540990264506,
            borrowed: '2',
            年度: '1999',
            室编档号: '1.02-永久-1999-0001',
            检查状态: '未检查',
            归档部门: '1537957874444',
            是否退回: '否',
            全宗: '1377226592843',
            是否并文: '否',
            归档人: '超级档案管理员',
            最后修改日期: '2018-10-31 20:51:04',
            archiveTypeId: 1352286661109,
            是否删除: '否'
          }
        ]
      ],
      date: '2018-10-31 20:51:04',
      description: '新增',
      id: 1540990264511,
      ip: '192.168.1.111',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        [
          {
            分类号: 'WS',
            保管期限: '永久',
            创建日期: '2018-10-10 10:43:23',
            最后修改人: '超级档案管理员',
            正题名: '1111',
            电子全文数: '0',
            状态: '待审核',
            fondsCode: '1377226592843',
            是否关联: '是',
            件号: '1',
            type: 'f',
            档案类型ID: '1352286661109',
            创建人: '超级档案管理员',
            id: 1539139403982,
            borrowed: '2',
            年度: '2018',
            室编档号: 'CES-WS-2018-31-0001',
            检查状态: '未检查',
            归档部门: '1537957874444',
            是否退回: '否',
            全宗: '1377226592843',
            是否并文: '否',
            归档人: '超级档案管理员',
            最后修改日期: '2018-10-10 10:43:23',
            archiveTypeId: 1352286661109,
            密级: '公开',
            是否删除: '否'
          }
        ]
      ],
      date: '2018-10-31 20:46:01',
      description: '关联',
      id: 1540989961831,
      ip: '192.168.1.111',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        [
          {
            分类号: '1.01',
            保管期限: '永久',
            创建日期: '2018-10-31 20:44:43',
            最后修改人: '超级档案管理员',
            正题名: '123',
            电子全文数: '0',
            状态: '待审核',
            fondsCode: '1377226592843',
            是否关联: '否',
            件号: '24',
            type: 'f',
            档案类型ID: '1352286661109',
            创建人: '超级档案管理员',
            id: 1540989883964,
            borrowed: '2',
            年度: '1999',
            室编档号: '1.01-永久-1999-0024',
            检查状态: '未检查',
            归档部门: '1537957874444',
            是否退回: '否',
            全宗: '1377226592843',
            是否并文: '否',
            归档人: '超级档案管理员',
            最后修改日期: '2018-10-31 20:44:43',
            archiveTypeId: 1352286661109,
            是否删除: '否'
          }
        ]
      ],
      date: '2018-10-31 20:44:43',
      description: '新增',
      id: 1540989883967,
      ip: '192.168.1.111',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        [
          {
            分类号: '1.01',
            保管期限: '永久',
            创建日期: '2018-10-31 20:43:48',
            最后修改人: '超级档案管理员',
            正题名: '123',
            电子全文数: '0',
            状态: '待审核',
            fondsCode: '1377226592843',
            是否关联: '否',
            件号: '23',
            type: 'f',
            档案类型ID: '1352286661109',
            创建人: '超级档案管理员',
            id: 1540989828373,
            borrowed: '2',
            年度: '1999',
            室编档号: '1.01-永久-1999-0023',
            检查状态: '未检查',
            归档部门: '1537957874444',
            是否退回: '否',
            全宗: '1377226592843',
            是否并文: '否',
            归档人: '超级档案管理员',
            最后修改日期: '2018-10-31 20:43:48',
            archiveTypeId: 1352286661109,
            是否删除: '否'
          }
        ]
      ],
      date: '2018-10-31 20:43:48',
      description: '新增',
      id: 1540989828380,
      ip: '192.168.1.111',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        '[{"保管期限":"永久","分类号":"1.01","正题名":"123","deptPassUser":"116","fondsCode":"1377226592843","是否关联":"是","type":"f","isModifyByRejected":"false","创建人":"超级档案管理员","id":1540989656784,"全宗":"1377226592843","是否退回":"否","创建日期":"2018-10-31 20:40:56","最后修改人":"超级档案管理员","状态":"部门审核通过","电子全文数":"2","页数":"0","件号":"21","档案类型ID":"1352286661109","年度":"1999","borrowed":"2","室编档号":"CES-永久-1999-0021","归档部门":"1537957874444","检查状态":"未检查","submitDeptUser":"116","是否并文":"是","归档人":"超级档案管理员","最后修改日期":"2018-10-31 20:40:56","archiv',
        'eTypeId":1352286661109,"是否删除":"否"}]'
      ],
      date: '2018-10-31 20:40:56',
      description: '并文',
      id: 1540989656831,
      ip: '192.168.1.111',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        '[{"保管期限":"永久","分类号":"1.01","正题名":"123","deptPassUser":"116","fondsCode":"1377226592843","是否关联":"是","type":"f","isModifyByRejected":"false","创建人":"超级档案管理员","id":1540017867771,"全宗":"1377226592843","是否退回":"否","创建日期":"2018-10-20 14:44:27","最后修改人":"超级档案管理员","状态":"部门审核通过","电子全文数":"0","件号":"21","档案类型ID":"1352286661109","年度":"1999","borrowed":"2","室编档号":"CES-永久-1999-0021","归档部门":"1537957874444","检查状态":"未检查","submitDeptUser":"116","是否并文":"否","归档人":"超级档案管理员","最后修改日期":"2018-10-20 14:44:27","archiveTypeId":',
        '1352286661109,"是否删除":"否"}]'
      ],
      date: '2018-10-31 20:35:23',
      description: '关联',
      id: 1540989323394,
      ip: '192.168.1.111',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    },
    {
      contentList: [
        [
          {
            父类目名称: '会议类',
            案卷题名: '1',
            分类号: 'A1.1',
            保管期限: '永久',
            创建日期: '2018-10-31 19:58:07',
            最后修改人: '超级档案管理员',
            状态: '待审核',
            fondsCode: '1377226592843',
            是否关联: '是',
            type: 'v',
            档案类型ID: '1352286676703',
            创建人: '超级档案管理员',
            id: 1540987087661,
            卷内数量: '0',
            年度: '1999',
            borrowed: '2',
            室编档号: 'A1.1-1999-永久-0005',
            检查状态: '未检查',
            归档部门: '1537957874444',
            是否退回: '否',
            全宗: '1377226592843',
            归档人: '超级档案管理员',
            案卷号: '5',
            最后修改日期: '2018-10-31 19:58:07',
            archiveTypeId: 1352286676703,
            是否删除: '否'
          }
        ]
      ],
      date: '2018-10-31 19:58:46',
      description: '关联',
      id: 1540987126948,
      ip: '192.168.1.111',
      officeArchivalCode: '',
      operate: '整理归档',
      result: '',
      titleProper: '',
      type: '3',
      user: '超级档案管理员'
    }
  ],
  firstResult: 0,
  maxRowCount: 20,
  message: '',
  pageCount: 4,
  pageNo: 0,
  pageSize: 20,
  startIndex: -20,
  totalCount: 80
}

export default {
  queryLog: () => {
    return {
      success: true,
      message: '',
      data: queryAll
    }
  },
  downLoad: () => {
    return {
      success: true,
      massage: ''
    }
  },
  queryLogs: () => {
    return {
      success: true,
      message: '',
      data: queryAllLog
    }
  },
  queryInfo: () => {
    return {
      success: true,
      massage: '',
      data:
        {
          父类目名称: '基本建设类',
          分类号: '6',
          案卷题名: '123',
          保管期限: '永久',
          deptPassUser: '116',
          fondsCode: '1377226592843',
          是否关联: '否',
          终止日期: '2018-11-12',
          type: 'v',
          isModifyByRejected: 'false',
          创建人: '超级档案管理员',
          id: 1541992822464,
          卷内数量: '1',
          全宗: '1377226592843',
          是否退回: '否',
          案卷号: '1',
          创建日期: '2018-11-12 11:20:22',
          归档日期: '2018-11-12',
          最后修改人: '超级档案管理员',
          状态: '待整理',
          页数: '0',
          档案类型ID: '1361066263788',
          接收日期: '2018-11-12',
          borrowed: '2',
          类目名称: '基本建设类',
          年度: '1999',
          室编档号: '6-1999-永久-0001',
          检查状态: '未检查',
          归档部门: '1537957874444',
          submitDeptUser: '116',
          归档人: '超级档案管理员',
          接收人: '超级档案管理员',
          最后修改日期: '2018-11-12 11:20:22',
          archiveTypeId: 1361066263788,
          起始日期: '2018-11-12',
          是否删除: '否'
        }
    }
  }
}
